Test Run By peter on Tue Apr 21 16:35:47 2015
Native configuration is x86_64-unknown-linux-gnu

		===  tests ===

Schedule of variations:
    unix

Running target unix
Using /usr/share/dejagnu/baseboards/unix.exp as board description file for target.
Using /usr/share/dejagnu/config/unix.exp as generic interface file for target.
WARNING: Couldn't find tool config file for unix, using default.
Running ./test.exp ...
spawn ./clic
Type '\h' to get some help5 + 5

clic2> 5 + 5
10.000000PASS: 5 + 5
5 - 5

clic2> 5 - 5
0.000000
clic2> PASS: 5 - 5
5 * 5
25.000000
clic2> PASS: 5 * 5
5 / 5
1.000000
clic2> PASS: 5 / 5
h1=5
5.000000PASS: h1=5
\c

clic2> \c
_const_0 = 5.000000 (readonly)PASS: \c
h2=2

clic2> h2=2
2.000000
clic2> PASS: h2=2
h3=0
0.000000
clic2> PASS: h3=0
h1*h2
10.000000
clic2> PASS: h1*h2
h1+h2
7.000000
clic2> PASS: h1+h2
h1-h2
3.000000
clic2> PASS: h1-h2
h1/h2
2.500000
clic2> PASS: h1/h2
e
2.718282
clic2> PASS: e
PI
3.141593
clic2> PASS: PI
PASS: sqrt(4)
sqrt(4)
2.000000
clic2> sqrt(-2)
-nan
clic2> PASS: sqrt(-2)
exp(1)
2.718282
clic2> PASS: exp(1)
cbrt(8)
2.000000
clic2> PASS: cbrt(8)
1 = 2
---invalid variable or function name
clic2> PASS: 1 = 2
\h
\v - variable list
\f - function list
\q - quit
clic2> PASS: \h
\v
e = 2.718282 (readonly)
PI = 3.141593 (readonly)
h1 = 5.000000
h2 = 2.000000
h3 = 0.000000
clic2> PASS: \v
\f
+
-
*
/
^
(
)
neg
nul
sin
cos
tg
arcsin
arccos
arctg
exp
ln
lg
sqrt
cbrt
sh
ch
th
erf
erfc
G
clic2> PASS: \f
neg(1)
-1.000000
clic2> PASS: neg(1)
neg(-1)
1.000000
clic2> PASS: neg(-1)
sin(1)
0.841471
clic2> PASS: sin(1)
cos(1)
0.540302
clic2> PASS: cos(1)
tg(1)
1.557408
clic2> PASS: tg(1)
arcsin(1)
1.570796
clic2> PASS: arcsin(1)
arccos(1)
0.000000
clic2> PASS: arccos(1)
arctg(1)
0.785398
clic2> PASS: arctg(1)
ln(2)
0.693147
clic2> PASS: ln(2)
ln(0)
-inf
clic2> PASS: ln(0)
ln(-1)
nan
clic2> PASS: ln(-1)
lg(2)
0.301030
clic2> PASS: lg(2)
lg(0)
-inf
clic2> PASS: lg(0)
lg(-1)
nan
clic2> PASS: lg(-1)
sh(1)
1.175201
clic2> PASS: sh(1)
ch(0)
1.000000
clic2> PASS: ch(0)
th(1)
0.761594
clic2> PASS: th(1)
erf(1)
0.842701
clic2> PASS: erf(1)
erfc(0)
1.000000
clic2> PASS: erfc(0)
G(1)
1.000000
clic2> PASS: G(1)
f1=1
1.000000
clic2> PASS: f1=1
f1=f2
---unknown identifier
clic2> PASS: f1=f2
f2=1
1.000000
clic2> PASS: f2=1
f1=f2
1.000000
clic2> PASS: f1=f2
sqrt(tg(PI/2))
127793737.535121
clic2> PASS: sqrt(tg(PI/2))
(6/0) - (6/0)
-nan
clic2> PASS: (6/0) - (6/0)
2^4
16.000000
clic2> PASS: 2^4
nul(1)
1.000000
clic2> PASS: nul(1)
+ 1 2
12.000000
clic2> PASS: + 1 2
* 1 2
---syntax error
clic2> PASS: * 1 2
sqrt(æ)
---unknown identifier
clic2> PASS: sqrt(æ)
sqrt=1
---name conflict
clic2> PASS: sqrt=1
hæ=1
---invalid variable or function name
clic2> PASS: hæ=1
arcsin(2)
nan
clic2> PASS: arcsin(2)
arccos(2)
nan
clic2> PASS: arccos(2)
hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh1=1
---identifier is too long
clic2> PASS: hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh1=1
= =
---more than one '='PASS: = =
PI=2

clic2> PI=2
---you can not change the valuePASS: PI=2
G

clic2> G
---syntax error
clic2> PASS: G
h1+h2+h9
---unknown identifier
clic2> PASS: h1+h2+h9
h1%h2
---unknown identifier
clic2> PASS: h1%h2
h1/h3
inf
clic2> PASS: h1/h3
^ 2 3
---syntax error
clic2> PASS: ^ 2 3
5%5
---invalid constant
clic2> PASS: 5%5
\g
---unknown command
clic2> PASS: \g
v1025=1
1.000000
clic2> v1024=1
1.000000
clic2> v1023=1
1.000000
clic2> v1022=1
1.000000
clic2> v1021=1
1.000000
clic2> v1020=1
1.000000
clic2> v1019=1
1.000000
clic2> v1018=1
1.000000
clic2> v1017=1
1.000000
clic2> v1016=1
1.000000
clic2> v1015=1
1.000000
clic2> v1014=1
1.000000
clic2> v1013=1
1.000000
clic2> v1012=1
1.000000
clic2> v1011=1
1.000000
clic2> v1010=1
1.000000
clic2> v1009=1
1.000000
clic2> v1008=1
1.000000
clic2> v1007=1
1.000000
clic2> v1006=1
1.000000
clic2> v1005=1
1.000000
clic2> v1004=1
1.000000
clic2> v1003=1
1.000000
clic2> v1002=1
1.000000
clic2> v1001=1
1.000000
v1000=1
v999=1
v998=1
v997=1
v996=1
v995=1
v994=1
v993=1
v992=1
v991=1
v990=1
v989=1
v988=1
v987=1
v986=1
v985=1
v984=1
v983=1
v982=1
v981=1
v980=1
v979=1
v978=1
v977=1
v976=1
v975=1
v974=1
v973=1
v972=1
v971=1
v970=1
v969=1
v968=1
v967=1
v966=1
v965=1
v964=1
v963=1
v962=1
v961=1
v960=1
v959=1
v958=1
v957=1
v956=1
v955=1
v954=1
v953=1
v952=1
v951=1
v950=1
v949=1
v948=1
v947=1
v946=1
v945=1
v944=1
v943=1
v942=1
v941=1
v940=1
v939=1
v938=1
v937=1
v936=1
v935=1
v934=1
v933=1
v932=1
v931=1
v930=1
v929=1
v928=1
v927=1
v926=1
v925=1
v924=1
v923=1
v922=1
v921=1
v920=1
v919=1
v918=1
v917=1
v916=1
v915=1
v914=1
v913=1
v912=1
v911=1
v910=1
v909=1
v908=1
v907=1
v906=1
v905=1
v904=1
v903=1
v902=1
v901=1
v900=1
v899=1
v898=1
v897=1
v896=1
v895=1
v894=1
v893=1
v892=1
v891=1
v890=1
v889=1
v888=1
v887=1
v886=1
v885=1
v884=1
v883=1
v882=1
v881=1
v880=1
v879=1
v878=1
v877=1
v876=1
v875=1
v874=1
v873=1
v872=1
v871=1
v870=1
v869=1
v868=1
v867=1
v866=1
v865=1
v864=1
v863=1
v862=1
v861=1
v860=1
v859=1
v858=1
v857=1
v856=1
v855=1
v854=1
v853=1
v852=1
v851=1
v850=1
v849=1
v848=1
v847=1
v846=1
v845=1
v844=1
v843=1
v842=1
v841=1
v840=1
v839=1
v838=1
v837=1
v836=1
v835=1
v834=1
v833=1
v832=1
v831=1
v830=1
v829=1
v828=1
v827=1
v826=1
v825=1
v824=1
v823=1
v822=1
v821=1
v820=1
v819=1
v818=1
v817=1
v816=1
v815=1
v814=1
v813=1
v812=1
v811=1
v810=1
v809=1
v808=1
v807=1
v806=1
v805=1
v804=1
v803=1
v802=1
v801=1
v800=1
v799=1
v798=1
v797=1
v796=1
v795=1
v794=1
v793=1
v792=1
v791=1
v790=1
v789=1
v788=1
v787=1
v786=1
v785=1
v784=1
v783=1
v782=1
v781=1
v780=1
v779=1
v778=1
v777=1
v776=1
v775=1
v774=1
v773=1
v772=1
v771=1
v770=1
v769=1
v768=1
v767=1
v766=1
v765=1
v764=1
v763=1
v762=1
v761=1
v760=1
v759=1
v758=1
v757=1
v756=1
v755=1
v754=1
v753=1
v752=1
v751=1
v750=1
v749=1
v748=1
v747=1
v746=1
v745=1
v744=1
v743=1
v742=1
v741=1
v740=1
v739=1
v738=1
v737=1
v736=1
v735=1
v734=1
v733=1
v732=1
v731=1
v730=1
v729=1
v728=1
v727=1
v726=1
v725=1
v724=1
v723=1
v722=1
v721=1
v720=1
v719=1
v718=1
v717=1
v716=1
v715=1
v714=1
v713=1
v712=1
v711=1
v710=1
v709=1
v708=1
v707=1
v706=1
v705=1
v704=1
v703=1
v702=1
v701=1
v700=1
v699=1
v698=1
v697=1
v696=1
v695=1
v694=1
v693=1
v692=1
v691=1
v690=1
v689=1
v688=1
v687=1
v686=1
v685=1
v684=1
v683=1
v682=1
v681=1
v680=1
v679=1
v678=1
v677=1
v676=1
v675=1
v674=1
v673=1
v672=1
v671=1
v670=1
v669=1
v668=1
v667=1
v666=1
v665=1
v664=1
v663=1
v662=1
v661=1
v660=1
v659=1
v658=1
v657=1
v656=1
v655=1
v654=1
v653=1
v652=1
v651=1
v650=1
v649=1
v648=1
v647=1
v646=1
v645=1
v644=1
v643=1
v642=1
v641=1
v640=1
v639=1
v638=1
v637=1
v636=1
v635=1
v634=1
v633=1
v632=1
v631=1
v630=1
v629=1
v628=1
v627=1
v626=1
v625=1
v624=1
v623=1
v622=1
v621=1
v620=1
v619=1
v618=1
v617=1
v616=1
v615=1
v614=1
v613=1
v612=1
v611=1
v610=1
v609=1
v608=1
v607=1
v606=1
v605=1
v604=1
v603=1
v602=1
v601=1
v600=1
v599=1
v598=1
v597=1
v596=1
v595=1
v594=1
v593=1
v592=1
v591=1
v590=1
v589=1
v588=1
v587=1
v586=1
v585=1
v584=1
v583=1
v582=1
v581=1
v580=1
v579=1
v578=1
v577=1
v576=1
v575=1
v574=1
v573=1
clic2> v1000=1
1.000000v563=1
v562=1
v561=1
v560=1

v559=1
clic2> v999=1
1.000000v553=1

clic2> v998=1
1.000000v548=1

v547=1
clic2> v997=1
1.000000v541=1

clic2> v996=1
1.000000v535=1

clic2> v995=1
1.000000v529=1

clic2> v994=1
1.000000v523=1

clic2> v993=1
1.000000v517=1
v516=1
v515=1

clic2> v992=1
1.000000v513=1

clic2> v991=1
1.000000v508=1

clic2> v990=1
1.000000v502=1

v501=1
clic2> v989=1
1.000000v496=1
v495=1

clic2> v988=1
1.000000v489=1

clic2> v987=1
1.000000v483=1

clic2> v986=1
1.000000v476=1

clic2> v985=1
1.000000v470=1

clic2> v984=1
1.000000v464=1

clic2> v983=1
1.000000v457=1

clic2> v982=1
1.000000v451=1

clic2> v981=1
1.000000v445=1

clic2> v980=1
1.000000v439=1
v438=1

clic2> v979=1
1.000000
clic2> v978=1
1.000000
clic2> v977=1
1.000000
clic2> v976=1
1.000000v434=1

clic2> v975=1
1.000000v428=1

clic2> v974=1
1.000000v419=1
v418=1

clic2> v973=1
1.000000v412=1

clic2> v972=1
1.000000v406=1

clic2> v971=1
1.000000v387=1

clic2> v970=1
1.000000
clic2> v969=1
1.000000
clic2> v968=1
1.000000
clic2> v967=1
1.000000
clic2> v966=1
1.000000
clic2> v965=1
1.000000
clic2> v964=1
1.000000
clic2> v963=1
1.000000
clic2> v962=1
1.000000
clic2> v961=1
1.000000
clic2> v960=1
1.000000
clic2> v959=1
1.000000
clic2> v958=1
1.000000
clic2> v957=1
1.000000
clic2> v956=1
1.000000
clic2> v955=1
1.000000
clic2> v954=1
1.000000
clic2> v953=1
1.000000
clic2> v952=1
1.000000
clic2> v951=1
1.000000
clic2> v950=1
1.000000
clic2> v949=1
1.000000
clic2> v948=1
1.000000
clic2> v947=1
1.000000
clic2> v946=1
1.000000
clic2> v945=1
1.000000
clic2> v944=1
1.000000
clic2> v943=1
1.000000
clic2> v942=1
1.000000
clic2> v941=1
1.000000
clic2> v940=1
1.000000
clic2> v939=1
1.000000
clic2> v938=1
1.000000
clic2> v937=1
1.000000
clic2> v936=1
1.000000
clic2> v935=1
1.000000
clic2> v934=1
1.000000
clic2> v933=1
1.000000
clic2> v932=1
1.000000
clic2> v931=1
1.000000
clic2> v930=1
1.000000
clic2> v929=1
1.000000
clic2> v928=1
1.000000
clic2> v927=1
1.000000
clic2> v926=1
1.000000
clic2> v925=1
1.000000
clic2> v924=1
1.000000
clic2> v923=1
1.000000
clic2> v922=1
1.000000
clic2> v921=1
1.000000
clic2> v920=1
1.000000
clic2> v919=1
1.000000
clic2> v918=1
1.000000
clic2> v917=1
1.000000
clic2> v916=1
1.000000
clic2> v915=1
1.000000
clic2> v914=1
1.000000
clic2> v913=1
1.000000
clic2> v912=1
1.000000
clic2> v911=1
1.000000
clic2> v910=1
1.000000
clic2> v909=1
1.000000
clic2> v908=1
1.000000
clic2> v907=1
1.000000
clic2> v906=1
1.000000
clic2> v905=1
1.000000
clic2> v904=1
1.000000
clic2> v903=1
1.000000
clic2> v902=1
1.000000
clic2> v901=1
1.000000
clic2> v900=1
1.000000
clic2> v899=1
1.000000
clic2> v898=1
1.000000
clic2> v897=1
1.000000
clic2> v896=1
1.000000
clic2> v895=1
1.000000
clic2> v894=1
1.000000
clic2> v893=1
1.000000
clic2> v892=1
1.000000
clic2> v891=1
1.000000
clic2> v890=1
1.000000
clic2> v889=1
1.000000
clic2> v888=1
1.000000
clic2> v887=1
1.000000
clic2> v886=1
1.000000
clic2> v885=1
1.000000
clic2> v884=1
1.000000
clic2> v883=1
1.000000
clic2> v882=1
1.000000
clic2> v881=1
1.000000
clic2> v880=1
1.000000
clic2> v879=1
1.000000
clic2> v878=1
1.000000
clic2> v877=1
1.000000
clic2> v876=1
1.000000
clic2> v875=1
1.000000
clic2> v874=1
1.000000
clic2> v873=1
1.000000
clic2> v872=1
1.000000
clic2> v871=1
1.000000
clic2> v870=1
1.000000
clic2> v869=1
1.000000
clic2> v868=1
1.000000
clic2> v867=1
1.000000
clic2> v866=1
1.000000
clic2> v865=1
1.000000
clic2> v864=1
1.000000
clic2> v863=1
1.000000
clic2> v862=1
1.000000
clic2> v861=1
1.000000
clic2> v860=1
1.000000
clic2> v859=1
1.000000
clic2> v858=1
1.000000
clic2> v857=1
1.000000
clic2> v856=1
1.000000
clic2> v855=1
1.000000
clic2> v854=1
1.000000
clic2> v853=1
1.000000
clic2> v852=1
1.000000
clic2> v851=1
1.000000
clic2> v850=1
1.000000
clic2> v849=1
1.000000
clic2> v848=1
1.000000
clic2> v847=1
1.000000
clic2> v846=1
1.000000
clic2> v845=1
1.000000
clic2> v844=1
1.000000
clic2> v843=1
1.000000
clic2> v842=1
1.000000
clic2> v841=1
1.000000
clic2> v840=1
1.000000
clic2> v839=1
1.000000
clic2> v838=1
1.000000
clic2> v837=1
1.000000
clic2> v836=1
1.000000
clic2> v835=1
1.000000
clic2> v834=1
1.000000
clic2> v833=1
1.000000
clic2> v832=1
1.000000
clic2> v831=1
1.000000
clic2> v830=1
1.000000
clic2> v829=1
1.000000
clic2> v828=1
1.000000
clic2> v827=1
1.000000
clic2> v826=1
1.000000
clic2> v825=1
1.000000
clic2> v824=1
1.000000
clic2> v823=1
1.000000
clic2> v822=1
1.000000
clic2> v821=1
1.000000
clic2> v820=1
1.000000
clic2> v819=1
1.000000
clic2> v818=1
1.000000
clic2> v817=1
1.000000
clic2> v816=1
1.000000
clic2> v815=1
1.000000
clic2> v814=1
1.000000
clic2> v813=1
1.000000
clic2> v812=1
1.000000
clic2> v811=1
1.000000
clic2> v810=1
1.000000
clic2> v809=1
1.000000
clic2> v808=1
1.000000
clic2> v807=1
1.000000
clic2> v806=1
1.000000
clic2> v805=1
1.000000
clic2> v804=1
1.000000
clic2> v803=1
1.000000
clic2> v802=1
1.000000
clic2> v801=1
1.000000
clic2> v800=1
1.000000
clic2> v799=1
1.000000
clic2> v798=1
1.000000
clic2> v797=1
1.000000
clic2> v796=1
1.000000
clic2> v795=1
1.000000
clic2> v794=1
1.000000
clic2> v793=1
1.000000
clic2> v792=1
1.000000
clic2> v791=1
1.000000
clic2> v790=1
1.000000
clic2> v789=1
1.000000
clic2> v788=1
1.000000
clic2> v787=1
1.000000
clic2> v786=1
1.000000
clic2> v785=1
1.000000
clic2> v784=1
1.000000
clic2> v783=1
1.000000
clic2> v782=1
1.000000
clic2> v781=1
1.000000
clic2> v780=1
1.000000
clic2> v779=1
1.000000
clic2> v778=1
1.000000
clic2> v777=1
1.000000
clic2> v776=1
1.000000
clic2> v775=1
1.000000
clic2> v774=1
1.000000
clic2> v773=1
1.000000
clic2> v772=1
1.000000
clic2> v771=1
1.000000
clic2> v770=1
1.000000
clic2> v769=1
1.000000
clic2> v768=1
1.000000
clic2> v767=1
1.000000
clic2> v766=1
1.000000
clic2> v765=1
1.000000
clic2> v764=1
1.000000
clic2> v763=1
1.000000
clic2> v762=1
1.000000
clic2> v761=1
1.000000
clic2> v760=1
1.000000
clic2> v759=1
1.000000
clic2> v758=1
1.000000
clic2> v757=1
1.000000
clic2> v756=1
1.000000
clic2> v755=1
1.000000
clic2> v754=1
1.000000
clic2> v753=1
1.000000
clic2> v752=1
1.000000
clic2> v751=1
1.000000
clic2> v750=1
1.000000
clic2> v749=1
1.000000
clic2> v748=1
1.000000
clic2> v747=1
1.000000
clic2> v746=1
1.000000
clic2> v745=1
1.000000
clic2> v744=1
1.000000
clic2> v743=1
1.000000
clic2> v742=1
1.000000
clic2> v741=1
1.000000
clic2> v740=1
1.000000
clic2> v739=1
1.000000
clic2> v738=1
1.000000
clic2> v737=1
1.000000
clic2> v736=1
1.000000
clic2> v735=1
1.000000
clic2> v734=1
1.000000
clic2> v733=1
1.000000
clic2> v732=1
1.000000
clic2> v731=1
1.000000
clic2> v730=1
1.000000
clic2> v729=1
1.000000
clic2> v728=1
1.000000
clic2> v727=1
1.000000
clic2> v726=1
1.000000
clic2> v725=1
1.000000
clic2> v724=1
1.000000
clic2> v723=1
1.000000
clic2> v722=1
1.000000
clic2> v721=1
1.000000
clic2> v720=1
1.000000
clic2> v719=1
1.000000
clic2> v718=1
1.000000
clic2> v717=1
1.000000
clic2> v716=1
1.000000
clic2> v715=1
1.000000
clic2> v714=1
1.000000
clic2> v713=1
1.000000
clic2> v712=1
1.000000
clic2> v711=1
1.000000
clic2> v710=1
1.000000
clic2> v709=1
1.000000
clic2> v708=1
1.000000
clic2> v707=1
1.000000
clic2> v706=1
1.000000
clic2> v705=1
1.000000
clic2> v704=1
1.000000
clic2> v703=1
1.000000
clic2> v702=1
1.000000
clic2> v701=1
1.000000
clic2> v700=1
1.000000
clic2> v699=1
1.000000
clic2> v698=1
1.000000
clic2> v697=1
1.000000
clic2> v696=1
1.000000
clic2> v695=1
1.000000
clic2> v694=1
1.000000
clic2> v693=1
1.000000
clic2> v692=1
1.000000
clic2> v691=1
1.000000
clic2> v690=1
1.000000
clic2> v689=1
1.000000
clic2> v688=1
1.000000
clic2> v687=1
1.000000
clic2> v686=1
1.000000
clic2> v685=1
1.000000
clic2> v684=1
1.000000
clic2> v683=1
1.000000
clic2> v682=1
1.000000
clic2> v681=1
1.000000
clic2> v680=1
1.000000
clic2> v679=1
1.000000
clic2> v678=1
1.000000
clic2> v677=1
1.000000
clic2> v676=1
1.000000
clic2> v675=1
1.000000
clic2> v674=1
1.000000
clic2> v673=1
1.000000
clic2> v672=1
1.000000
clic2> v671=1
1.000000
clic2> v670=1
1.000000
clic2> v669=1
1.000000
clic2> v668=1
1.000000
clic2> v667=1
1.000000
clic2> v666=1
1.000000
clic2> v665=1
1.000000
clic2> v664=1
1.000000
clic2> v663=1
1.000000
clic2> v662=1
1.000000
clic2> v661=1
1.000000
clic2> v660=1
1.000000
clic2> v659=1
1.000000
clic2> v658=1
1.000000
clic2> v657=1
1.000000
clic2> v656=1
1.000000
clic2> v655=1
1.000000
clic2> v654=1
1.000000
clic2> v653=1
1.000000
clic2> v652=1
1.000000
clic2> v651=1
1.000000
clic2> v650=1
1.000000
clic2> v649=1
1.000000
clic2> v648=1
1.000000
clic2> v647=1
1.000000
clic2> v646=1
1.000000
clic2> v645=1
1.000000
clic2> v644=1
1.000000
clic2> v643=1
1.000000
clic2> v642=1
1.000000
clic2> v641=1
1.000000
clic2> v640=1
1.000000
clic2> v639=1
1.000000
clic2> v638=1
1.000000
clic2> v637=1
1.000000
clic2> v636=1
1.000000
clic2> v635=1
1.000000
clic2> v634=1
1.000000
clic2> v633=1
1.000000
clic2> v632=1
1.000000
clic2> v631=1
1.000000
clic2> v630=1
1.000000
clic2> v629=1
1.000000
clic2> v628=1
1.000000
clic2> v627=1
1.000000
clic2> v626=1
1.000000
clic2> v625=1
1.000000
clic2> v624=1
1.000000
clic2> v623=1
1.000000
clic2> v622=1
1.000000
clic2> v621=1
1.000000
clic2> v620=1
1.000000
clic2> v619=1
1.000000
clic2> v618=1
1.000000
clic2> v617=1
1.000000
clic2> v616=1
1.000000
clic2> v615=1
1.000000
clic2> v614=1
1.000000
clic2> v613=1
1.000000
clic2> v612=1
1.000000
clic2> v611=1
1.000000
clic2> v610=1
1.000000
clic2> v609=1
1.000000
clic2> v608=1
1.000000
clic2> v607=1
1.000000
clic2> v606=1
1.000000
clic2> v605=1
1.000000
clic2> v604=1
1.000000
clic2> v603=1
1.000000
clic2> v602=1
1.000000
clic2> v601=1
1.000000
clic2> v600=1
1.000000
clic2> v599=1
1.000000
clic2> v598=1
1.000000
clic2> v597=1
1.000000
clic2> v596=1
1.000000
clic2> v595=1
1.000000
clic2> v594=1
1.000000
clic2> v593=1
1.000000
clic2> v592=1
1.000000
clic2> v591=1
1.000000
clic2> v590=1
1.000000
clic2> v589=1
1.000000
clic2> v588=1
1.000000
clic2> v587=1
1.000000
clic2> v586=1
1.000000
clic2> v585=1
1.000000
clic2> v584=1
1.000000
clic2> v583=1
1.000000
clic2> v582=1
1.000000
clic2> v581=1
1.000000
clic2> v580=1
1.000000
clic2> v579=1
1.000000
clic2> v578=1
1.000000
clic2> v577=1
1.000000
clic2> v576=1
1.000000
clic2> v575=1
1.000000
clic2> v574=1
1.000000
clic2> v573=1
1.000000
clic2> v572=1
1.000000
clic2> v571=1
1.000000
clic2> v570=1
1.000000
clic2> v569=1
1.000000
clic2> v568=1
1.000000
clic2> v567=1
1.000000
clic2> v566=1
1.000000
clic2> v565=1
1.000000
clic2> v564=1
1.000000
clic2> v563=1
1.000000
clic2> v562=1
1.000000
clic2> v561=1
1.000000
clic2> v560=1
1.000000
clic2> v559=1
1.000000
clic2> v558=1
1.000000
clic2> v557=1
1.000000
clic2> v556=1
1.000000
clic2> v555=1
1.000000
clic2> v554=1
1.000000
clic2> v553=1
1.000000
clic2> v552=1
1.000000
clic2> v551=1
1.000000
clic2> v550=1
1.000000
clic2> v549=1
1.000000
clic2> v548=1
1.000000
clic2> v547=1
1.000000
clic2> v546=1
1.000000
clic2> v545=1
1.000000
clic2> v544=1
1.000000
clic2> v543=1
1.000000
clic2> v542=1
1.000000
clic2> v541=1
1.000000
clic2> v540=1
1.000000
clic2> v539=1
1.000000
clic2> v538=1
1.000000
clic2> v537=1
1.000000
clic2> v536=1
1.000000
clic2> v535=1
1.000000
clic2> v534=1
1.000000
clic2> v533=1
1.000000
clic2> v532=1
1.000000
clic2> v531=1
1.000000
clic2> v530=1
1.000000
clic2> v529=1
1.000000
clic2> v528=1
1.000000
clic2> v527=1
1.000000
clic2> v526=1
1.000000
clic2> v525=1
1.000000
clic2> v524=1
1.000000
clic2> v523=1
1.000000
clic2> v522=1
1.000000
clic2> v521=1
1.000000
clic2> v520=1
1.000000
clic2> v519=1
1.000000
clic2> v518=1
1.000000
clic2> v517=1
1.000000
clic2> v516=1
1.000000
clic2> v515=1
1.000000
clic2> v514=1
1.000000
clic2> v513=1
1.000000
clic2> v512=1
1.000000
clic2> v511=1
1.000000
clic2> v510=1
1.000000
clic2> v509=1
1.0000001025+
clic2> v508=1
1.0000001021+1020+1019+
clic2> v507=1
1.0000001013+1012+1011+
clic2> v506=1
1.0000001005+
clic2> v505=1
1.0000001000+999+998+
clic2> v504=1
1.000000992+991+990+
989+clic2> v503=1
1.000000983+982+981+
clic2> v502=1
1.000000975+974+973+
clic2> v501=1
1.000000967+966+965+
clic2> v500=1
1.000000959+958+
clic2> v499=1
1.000000952+951+950+
clic2> v498=1
1.000000944+943+942+
clic2> v497=1
1.000000936+935+934+
clic2> v496=1
1.000000928+927+
clic2> v495=1
1.000000
clic2> v494=1
1.000000922+921+920+
clic2> v493=1
1.000000915+
clic2> v492=1
1.000000912+911+910+909+908+
clic2> v491=1
1.000000902+901+900+
clic2> v490=1
1.000000894+893+892+
clic2> v489=1
1.000000886+885+884+
clic2> v488=1
1.000000878+877+
clic2> v487=1
1.000000872+871+870+869+868+867+866+
clic2> v486=1
1.000000859+858+
clic2> v485=1
1.000000851+850+
clic2> v484=1
1.000000844+843+
842+clic2> v483=1
1.000000837+836+835+
834+clic2> v482=1
1.000000829+828+827+
826+clic2> v481=1
1.000000
clic2> v480=1
1.000000
clic2> v479=1
1.000000
clic2> v478=1
1.000000
clic2> v477=1
1.000000
clic2> v476=1
1.000000
clic2> v475=1
1.000000
clic2> v474=1
1.000000
clic2> v473=1
1.000000
clic2> v472=1
1.000000
clic2> v471=1
1.000000
clic2> v470=1
1.000000
clic2> v469=1
1.000000
clic2> v468=1
1.000000
clic2> v467=1
1.000000
clic2> v466=1
1.000000
clic2> v465=1
1.000000
clic2> v464=1
1.000000
clic2> v463=1
1.000000
clic2> v462=1
1.000000
clic2> v461=1
1.000000
clic2> v460=1
1.000000
clic2> v459=1
1.000000
clic2> v458=1
1.000000
clic2> v457=1
1.000000
clic2> v456=1
1.000000
clic2> v455=1
1.000000
clic2> v454=1
1.000000
clic2> v453=1
1.000000
clic2> v452=1
1.000000
clic2> v451=1
1.000000
clic2> v450=1
1.000000
clic2> v449=1
1.000000
clic2> v448=1
1.000000
clic2> v447=1
1.000000
clic2> v446=1
1.000000
clic2> v445=1
1.000000
clic2> v444=1
1.000000
clic2> v443=1
1.000000
clic2> v442=1
1.000000
clic2> v441=1
1.000000
clic2> v440=1
1.000000
clic2> v439=1
1.000000
clic2> v438=1
1.000000
clic2> v437=1
1.000000
clic2> v436=1
1.000000
clic2> v435=1
1.000000
clic2> v434=1
1.000000
clic2> v433=1
1.000000
clic2> v432=1
1.000000
clic2> v431=1
1.000000
clic2> v430=1
1.000000
clic2> v429=1
1.000000
clic2> v428=1
1.000000
clic2> v427=1
1.000000
clic2> v426=1
1.000000
clic2> v425=1
1.000000
clic2> v424=1
1.000000
clic2> v423=1
1.000000
clic2> v422=1
1.000000
clic2> v421=1
1.000000
clic2> v420=1
1.000000
clic2> v419=1
1.000000
clic2> v418=1
1.000000
clic2> v417=1
1.000000
clic2> v416=1
1.000000
clic2> v415=1
1.000000
clic2> v414=1
1.000000
clic2> v413=1
1.000000
clic2> v412=1
1.000000
clic2> v411=1
1.000000
clic2> v410=1
1.000000
clic2> v409=1
1.000000
clic2> v408=1
1.000000
clic2> v407=1
1.000000
clic2> v406=1
1.000000
clic2> v405=1
1.000000
clic2> v404=1
1.000000
clic2> v403=1
1.000000
clic2> v402=1
1.000000
clic2> v401=1
1.000000
clic2> v400=1
1.000000
clic2> v399=1
1.000000
clic2> v398=1
1.000000
clic2> v397=1
1.000000
clic2> v396=1
1.000000
clic2> v395=1
1.000000
clic2> v394=1
1.000000
clic2> v393=1
1.000000
clic2> v392=1
1.000000
clic2> v391=1
1.000000
clic2> v390=1
1.000000
clic2> v389=1
1.000000
clic2> v388=1
1.000000
clic2> v387=1
1.000000
clic2> v386=1
1.000000
clic2> v385=1
1.000000
clic2> v384=1
1.000000
clic2> v383=1
1.000000
clic2> v382=1
1.000000
clic2> v381=1
1.000000
clic2> v380=1
1.000000
clic2> v379=1
1.000000
clic2> v378=1
1.000000
clic2> v377=1
1.000000
clic2> v376=1
1.000000
clic2> v375=1
1.000000
clic2> v374=1
1.000000
clic2> v373=1
1.000000
clic2> v372=1
1.000000
clic2> v371=1
1.000000
clic2> v370=1
1.000000
clic2> v369=1
1.000000
clic2> v368=1
1.000000
clic2> v367=1
1.000000
clic2> v366=1
1.000000
clic2> v365=1
1.000000
clic2> v364=1
1.000000
clic2> v363=1
1.000000
clic2> v362=1
1.000000
clic2> v361=1
1.000000
clic2> v360=1
1.000000
clic2> v359=1
1.000000
clic2> v358=1
1.000000
clic2> v357=1
1.000000
clic2> v356=1
1.000000
clic2> v355=1
1.000000
clic2> v354=1
1.000000
clic2> v353=1
1.000000
clic2> v352=1
1.000000
clic2> v351=1
1.000000
clic2> v350=1
1.000000
clic2> v349=1
1.000000
clic2> v348=1
1.000000
clic2> v347=1
1.000000
clic2> v346=1
1.000000
clic2> v345=1
1.000000
clic2> v344=1
1.000000
clic2> v343=1
1.000000
clic2> v342=1
1.000000
clic2> v341=1
1.000000
clic2> v340=1
1.000000
clic2> v339=1
1.000000
clic2> v338=1
1.000000
clic2> v337=1
1.000000
clic2> v336=1
1.000000
clic2> v335=1
1.000000
clic2> v334=1
1.000000
clic2> v333=1
1.000000
clic2> v332=1
1.000000
clic2> v331=1
1.000000
clic2> v330=1
1.000000
clic2> v329=1
1.000000
clic2> v328=1
1.000000
clic2> v327=1
1.000000
clic2> v326=1
1.000000
clic2> v325=1
1.000000
clic2> v324=1
1.000000
clic2> v323=1
1.000000
clic2> v322=1
1.000000
clic2> v321=1
1.000000
clic2> v320=1
1.000000
clic2> v319=1
1.000000
clic2> v318=1
1.000000
clic2> v317=1
1.000000
clic2> v316=1
1.000000
clic2> v315=1
1.000000
clic2> v314=1
1.000000
clic2> v313=1
1.000000
clic2> v312=1
1.000000
clic2> v311=1
1.000000
clic2> v310=1
1.000000
clic2> v309=1
1.000000
clic2> v308=1
1.000000
clic2> v307=1
1.000000
clic2> v306=1
1.000000
clic2> v305=1
1.000000
clic2> v304=1
1.000000
clic2> v303=1
1.000000
clic2> v302=1
1.000000
clic2> v301=1
1.000000
clic2> v300=1
1.000000
clic2> v299=1
1.000000
clic2> v298=1
1.000000
clic2> v297=1
1.000000
clic2> v296=1
1.000000
clic2> v295=1
1.000000
clic2> v294=1
1.000000
clic2> v293=1
1.000000
clic2> v292=1
1.000000
clic2> v291=1
1.000000
clic2> v290=1
1.000000
clic2> v289=1
1.000000
clic2> v288=1
1.000000
clic2> v287=1
1.000000
clic2> v286=1
1.000000
clic2> v285=1
1.000000
clic2> v284=1
1.000000
clic2> v283=1
1.000000
clic2> v282=1
1.000000
clic2> v281=1
1.000000
clic2> v280=1
1.000000
clic2> v279=1
1.000000
clic2> v278=1
1.000000
clic2> v277=1
1.000000
clic2> v276=1
1.000000
clic2> v275=1
1.000000
clic2> v274=1
1.000000
clic2> v273=1
1.000000
clic2> v272=1
1.000000
clic2> v271=1
1.000000
clic2> v270=1
1.000000
clic2> v269=1
1.000000
clic2> v268=1
1.000000
clic2> v267=1
1.000000
clic2> v266=1
1.000000
clic2> v265=1
1.000000
clic2> v264=1
1.000000
clic2> v263=1
1.000000
clic2> v262=1
1.000000
clic2> v261=1
1.000000
clic2> v260=1
1.000000
clic2> v259=1
1.000000
clic2> v258=1
1.000000
clic2> v257=1
1.000000
clic2> v256=1
1.000000
clic2> v255=1
1.000000
clic2> v254=1
1.000000
clic2> v253=1
1.000000
clic2> v252=1
1.000000
clic2> v251=1
1.000000
clic2> v250=1
1.000000
clic2> v249=1
1.000000
clic2> v248=1
1.000000
clic2> v247=1
1.000000
clic2> v246=1
1.000000
clic2> v245=1
1.000000
clic2> v244=1
1.000000
clic2> v243=1
1.000000
clic2> v242=1
1.000000
clic2> v241=1
1.000000
clic2> v240=1
1.000000
clic2> v239=1
1.000000
clic2> v238=1
1.000000
clic2> v237=1
1.000000
clic2> v236=1
1.000000
clic2> v235=1
1.000000
clic2> v234=1
1.000000
clic2> v233=1
1.000000
clic2> v232=1
1.000000
clic2> v231=1
1.000000
clic2> v230=1
1.000000
clic2> v229=1
1.000000
clic2> v228=1
1.000000
clic2> v227=1
1.000000
clic2> v226=1
1.000000
clic2> v225=1
1.000000
clic2> v224=1
1.000000
clic2> v223=1
1.000000
clic2> v222=1
1.000000
clic2> v221=1
1.000000
clic2> v220=1
1.000000
clic2> v219=1
1.000000
clic2> v218=1
1.000000
clic2> v217=1
1.000000
clic2> v216=1
1.000000
clic2> v215=1
1.000000
clic2> v214=1
1.000000
clic2> v213=1
1.000000
clic2> v212=1
1.000000
clic2> v211=1
1.000000
clic2> v210=1
1.000000
clic2> v209=1
1.000000
clic2> v208=1
1.000000
clic2> v207=1
1.000000
clic2> v206=1
1.000000
clic2> v205=1
1.000000
clic2> v204=1
1.000000
clic2> v203=1
1.000000
clic2> v202=1
1.000000
clic2> v201=1
1.000000
clic2> v200=1
1.000000
clic2> v199=1
1.000000
clic2> v198=1
1.000000
clic2> v197=1
1.000000
clic2> v196=1
1.000000
clic2> v195=1
1.000000
clic2> v194=1
1.000000
clic2> v193=1
1.000000
clic2> v192=1
1.000000
clic2> v191=1
1.000000
clic2> v190=1
1.000000
clic2> v189=1
1.000000
clic2> v188=1
1.000000
clic2> v187=1
1.000000
clic2> v186=1
1.000000
clic2> v185=1
1.000000
clic2> v184=1
1.000000
clic2> v183=1
1.000000
clic2> v182=1
1.000000
clic2> v181=1
1.000000
clic2> v180=1
1.000000
clic2> v179=1
1.000000
clic2> v178=1
1.000000
clic2> v177=1
1.000000
clic2> v176=1
1.000000
clic2> v175=1
1.000000
clic2> v174=1
1.000000
clic2> v173=1
1.000000
clic2> v172=1
1.000000
clic2> v171=1
1.000000
clic2> v170=1
1.000000
clic2> v169=1
1.000000
clic2> v168=1
1.000000
clic2> v167=1
1.000000
clic2> v166=1
1.000000
clic2> v165=1
1.000000
clic2> v164=1
1.000000
clic2> v163=1
1.000000
clic2> v162=1
1.000000
clic2> v161=1
1.000000
clic2> v160=1
1.000000
clic2> v159=1
1.000000
clic2> v158=1
1.000000
clic2> v157=1
1.000000
clic2> v156=1
1.000000
clic2> v155=1
1.000000
clic2> v154=1
1.000000
clic2> v153=1
1.000000
clic2> v152=1
1.000000
clic2> v151=1
1.000000
clic2> v150=1
1.000000
clic2> v149=1
1.000000
clic2> v148=1
1.000000
clic2> v147=1
1.000000
clic2> v146=1
1.000000
clic2> v145=1
1.000000
clic2> v144=1
1.000000
clic2> v143=1
1.000000
clic2> v142=1
1.000000
clic2> v141=1
1.000000
clic2> v140=1
1.000000
clic2> v139=1
1.000000
clic2> v138=1
1.000000
clic2> v137=1
1.000000
clic2> v136=1
1.000000
clic2> v135=1
1.000000
clic2> v134=1
1.000000
clic2> v133=1
1.000000
clic2> v132=1
1.000000
clic2> v131=1
1.000000
clic2> v130=1
1.000000
clic2> v129=1
1.000000
clic2> v128=1
1.000000
clic2> v127=1
1.000000
clic2> v126=1
1.000000
clic2> v125=1
1.000000
clic2> v124=1
1.000000
clic2> v123=1
1.000000
clic2> v122=1
1.000000
clic2> v121=1
1.000000
clic2> v120=1
1.000000
clic2> v119=1
1.000000
clic2> v118=1
1.000000
clic2> v117=1
1.000000
clic2> v116=1
1.000000
clic2> v115=1
1.000000
clic2> v114=1
1.000000
clic2> v113=1
1.000000
clic2> v112=1
1.000000
clic2> v111=1
1.000000
clic2> v110=1
1.000000
clic2> v109=1
1.000000
clic2> v108=1
1.000000
clic2> v107=1
1.000000
clic2> v106=1
1.000000
clic2> v105=1
1.000000
clic2> v104=1
1.000000
clic2> v103=1
1.000000
clic2> v102=1
1.000000
clic2> v101=1
1.000000
clic2> v100=1
1.000000
clic2> v99=1
1.000000
clic2> v98=1
1.000000
clic2> v97=1
1.000000
clic2> v96=1
1.000000
clic2> v95=1
1.000000
clic2> v94=1
1.000000
clic2> v93=1
1.000000
clic2> v92=1
1.000000
clic2> v91=1
1.000000
clic2> v90=1
1.000000
clic2> v89=1
1.000000
clic2> v88=1
1.000000
clic2> v87=1
1.000000
clic2> v86=1
1.000000
clic2> v85=1
1.000000
clic2> v84=1
1.000000
clic2> v83=1
1.000000
clic2> v82=1
1.000000
clic2> v81=1
1.000000
clic2> v80=1
1.000000
clic2> v79=1
1.000000
clic2> v78=1
1.000000
clic2> v77=1
1.000000
clic2> v76=1
1.000000
clic2> v75=1
1.000000
clic2> v74=1
1.000000
clic2> v73=1
1.000000
clic2> v72=1
1.000000
clic2> v71=1
1.000000
clic2> v70=1
1.000000
clic2> v69=1
1.000000
clic2> v68=1
1.000000
clic2> v67=1
1.000000
clic2> v66=1
1.000000
clic2> v65=1
1.000000
clic2> v64=1
1.000000
clic2> v63=1
1.000000
clic2> v62=1
1.000000
clic2> v61=1
1.000000
clic2> v60=1
1.000000
clic2> v59=1
1.000000
clic2> v58=1
1.000000
clic2> v57=1
1.000000
clic2> v56=1
1.000000
clic2> v55=1
1.000000
clic2> v54=1
1.000000
clic2> v53=1
1.000000
clic2> v52=1
1.000000
clic2> v51=1
1.000000
clic2> v50=1
1.000000
clic2> v49=1
1.000000
clic2> v48=1
1.000000
clic2> v47=1
1.000000
clic2> v46=1
1.000000
clic2> v45=1
1.000000
clic2> v44=1
1.000000
clic2> v43=1
1.000000
clic2> v42=1
1.000000
clic2> v41=1
1.000000
clic2> v40=1
1.000000
clic2> v39=1
1.000000
clic2> v38=1
1.000000
clic2> v37=1
1.000000
clic2> v36=1
1.000000
clic2> v35=1
1.000000
clic2> v34=1
1.000000
clic2> v33=1
1.000000
clic2> v32=1
1.000000
clic2> v31=1
1.000000
clic2> v30=1
1.000000
clic2> v29=1
1.000000
clic2> v28=1
1.000000
clic2> v27=1
1.000000
clic2> v26=1
1.000000
clic2> v25=1
1.000000
clic2> v24=1
1.000000
clic2> v23=1
1.000000
clic2> v22=1
1.000000
clic2> v21=1
1.000000
clic2> v20=1
1.000000
clic2> v19=1
1.000000
clic2> v18=1
1.000000
clic2> v17=1
1.000000
clic2> v16=1
1.000000
clic2> v15=1
1.000000
clic2> v14=1
1.000000
clic2> v13=1
1.000000
clic2> v12=1
1.000000
clic2> v11=1
1.000000
clic2> v10=1
1.000000
clic2> v9=1
1.000000
clic2> v8=1
1.000000
clic2> v7=1
1.000000
clic2> v6=1
---no more space left for variables
clic2> v5=1
---no more space left for variables
clic2> v4=1
---no more space left for variables
clic2> v3=1
---no more space left for variables
clic2> v2=1
---no more space left for variables
clic2> v1=1
---no more space left for variables
clic2> v1026=1
---no more space left for variables
clic2> 1025+1024+1023+1022+1021+1020+1019+1018+1017+1016+1015+1014+1013+1012+1011+1010+1009+1008+1007+100 6+1005+1004+1003+1002+1001+1000+999+998+997+996+995+994+993+992+991+990+989+988+987+986+985+984+983+982+9 81+980+979+978+977+976+975+974+973+972+971+970+969+968+967+966+965+964+963+962+961+960+959+958+957+956+95 5+954+953+952+951+950+949+948+947+946+945+944+943+942+941+940+939+938+937+936+935+934+933+932+931+930+929 +928+927+926+925+924+923+922+921+920+919+918+917+916+915+914+913+912+911+910+909+908+907+906+905+904+903+ 902+901+900+899+898+897+896+895+894+893+892+891+890+889+888+887+886+885+884+883+882+881+880+879+878+877+8 76+875+874+873+872+871+870+869+868+867+866+865+864+863+862+861+860+859+858+857+856+855+854+853+852+851+85 0+849+848+847+846+845+844+843+842+841+840+839+838+837+836+835+834+833+832+831+830+829+828+827+826+825+824 +823+822+821+820+819+818+817+816+815+814+813+812+811+810+809+808+807+806+805+804+803+802+801+800+799+798+ 797+796+795+794+793+792+791+790+789+788+787+786+785+784+783+782+781+780+779+778+777+776+775+774+773+772+7 71+770+769+768+767+766+765+764+763+762+761+760+759+758+757+756+755+754+753+752+751+750+749+748+747+746+74 5+744+743+742+741+740+739+738+737+736+735+734+733+732+731+730+729+728+727+726+725+724+723+722+721+720+719 +718+717+716+715+714+713+712+711+710+709+708+707+706+705+704+703+702+701+700+699+698+697+696+695+694+693+ 692+691+690+689+688+687+686+685+684+683+682+681+680+679+678+677+676+675+674+673+672+671+670+669+668+667+6 66+665+664+663+662+661+660+659+658+657+656+655+654+653+652+651+650+649+648+647+646+645+644+643+642+641+64 0+639+638+637+636+635+634+633+632+631+630+629+628+627+626+625+624+623+622+621+620+619+618+617+616+615+614 +613+612+611+610+609+608+607+606+605+604+603+602+601+600+599+598+597+596+595+594+593+592+591+590+589+588+ 587+586+585+584+583+582+581+580+579+578+577+576+575+574+573+572+571+570+569+568+567+566+565+564+563+562+5 61+560+559+558+557+556+555+554+553+552+551+550+549+548+547+546+545+544+543+542+541+540+539+538+537+536+53 5+534+533+532+531+530+529+528+527+526+525+524+523+522+521+520+519+518+517+516+515+514+513+512+511+510+509 +508+507+506+505+504+503+502+501+500+499+498+497+496+495+494+493+492+491+490+489+488+487+486+485+484+483+ 482+481+480+479+478+477+476+475+474+473+472+471+470+469+468+467+466+465+464+463+462+461+460+459+458+457+4 56+455+454+453+452+451+450+449+448+447+446+445+444+443+442+441+440+439+438+437+436+435+434+433+432+431+43 0+429+428+427+426+425+424+423+422+421+420+419+418+417+416+415+414+413+412+411+410+409+408+407+406+405+404 +403+402+401+400+399+398+397+396+395+394+393+392+391+390+389+388+387+386+385+384+383+382+381+380+379+378+ 377+376+375+374+373+372+371+370+369+368+367+366+365+364+363+362+361+360+359+358+357+356+355+354+353+352+3 51+350+349+348+347+346+345+344+343+342+341+340+339+338+337+336+335+334+333+332+331+330+329+328+327+326+32 5+324+323+322+321+320+319+318+317+316+315+314+313+312+311+310+309+308+307+306+305+304+303+302+301+300+299 +298+297+296+295+294+293+292+291+290+289+288+287+286+285+284+283+282+281+280+279+278+277+276+275+274+273+ 272+271+270+269+268+267+266+265+264+263+262+261+260+259+258+257+256+255+254+253+252+251+250+249+248+247+2 46+245+244+243+242+241+240+239+238+237+236+235+234+233+232+231+230+229+228+227+226+225+224+223+222+221+22 0+219+218+217+216+215+214+213+212+211+210+209+208+207+206+205+204+203+202+201+200+199+198+197+196+195+194 +193+192+191+190+189+188+187+186+185+184+183+182+181+180+179+178+177+176+175+174+173+172+171+170+169+168+ 167+166+165+164+163+162+161+160+159+158+157+156+155+154+153+152+151+150+149+148+147+146+145+144+143+142+1 41+140+139+138+137+136+135+134+133+132+131+130+129+128+127+126+125+124+123+122+121+120+119+118+117+116+11 5+114+113+112+111+110+109+108+107+106+105+104+103+102+101+100+99+98+97+96+95+94+93+92+91+90+89+88+87+86+8 5+84+83+82+81+80+79+78+77+76+75+74+73+72+71+70+69+68+67+66+65+64+63+62+61+60+59+58+57+56+55+54+53+52+51+5 0+49+48+47+46+45+44+43+42+41+40+39+38+37+36+35+34+33+32+31+30+29+28+27+26+25+24+23+22+21+20+19+18+17+16+1 5+14+13+12+11+10+9+8+7+6+5+4+3+2+1+1
---constant storage is full
clic2> (1025+(1024+(1023+(1022+(1021+(1020+(1019+(1018+(1017+(1016+(1015+(1014+(1013+(1012+(1011+(1010+(1 009+(1008+(1007+(1006+(1005+(1004+(1003+(1002+(1001+(1000+(999+(998+(997+(996+(995+(994+(993+(992+(991+(9 90+(989+(988+(987+(986+(985+(984+(983+(982+(981+(980+(979+(978+(977+(976+(975+(974+(973+(972+(971+(970+(9 69+(968+(967+(966+(965+(964+(963+(962+(961+(960+(959+(958+(957+(956+(955+(954+(953+(952+(951+(950+(949+(9 48+(947+(946+(945+(944+(943+(942+(941+(940+(939+(938+(937+(936+(935+(934+(933+(932+(931+(930+(929+(928+(9 27+(926+(925+(924+(923+(922+(921+(920+(919+(918+(917+(916+(915+(914+(913+(912+(911+(910+(909+(908+(907+(9 06+(905+(904+(903+(902+(901+(900+(899+(898+(897+(896+(895+(894+(893+(892+(891+(890+(889+(888+(887+(886+(8 85+(884+(883+(882+(881+(880+(879+(878+(877+(876+(875+(874+(873+(872+(871+(870+(869+(868+(867+(866+(865+(8 64+(863+(862+(861+(860+(859+(858+(857+(856+(855+(854+(853+(852+(851+(850+(849+(848+(847+(846+(845+(844+(8 43+(842+(841+(840+(839+(838+(837+(836+(835+(834+(833+(832+(831+(830+(829+(828+(827+(826+(825+(824+(823+(8 22+(821+(820+(819+(818+(817+(816+(815+(814+(813+(812+(811+(810+(809+(808+(807+(806+(805+(804+(803+(802+(8 01+(800+(799+(798+(797+(796+(795+(794+(793+(792+(791+(790+(789+(788+(787+(786+(785+(784+(783+(782+(781+(7 80+(779+(778+(777+(776+(775+(774+(773+(772+(771+(770+(769+(768+(767+(766+(765+(764+(763+(762+(761+(760+(7 59+(758+(757+(756+(755+(754+(753+(752+(751+(750+(749+(748+(747+(746+(745+(744+(743+(742+(741+(740+(739+(7 38+(737+(736+(735+(734+(733+(732+(731+(730+(729+(728+(727+(726+(725+(724+(723+(722+(721+(720+(719+(718+(7 17+(716+(715+(714+(713+(712+(711+(710+(709+(708+(707+(706+(705+(704+(703+(702+(701+(700+(699+(698+(697+(6 96+(695+(694+(693+(692+(691+(690+(689+(688+(687+(686+(685+(684+(683+(682+(681+(680+(679+(678+(677+(676+(6 75+(674+(673+(672+(671+(670+(669+(668+(667+(666+(665+(664+(663+(662+(661+(660+(659+(658+(657+(656+(655+(6 54+(653+(652+(651+(650+(649+(648+(647+(646+(645+(644+(643+(642+(641+(640+(639+(638+(637+(636+(635+(634+(6 33+(632+(631+(630+(629+(628+(627+(626+(625+(624+(623+(622+(621+(620+(619+(618+(617+(616+(615+(614+(613+(6 12+(611+(610+(609+(608+(607+(606+(605+(604+(603+(602+(601+(600+(599+(598+(597+(596+(595+(594+(593+(592+(5 91+(590+(589+(588+(587+(586+(585+(584+(583+(582+(581+(580+(579+(578+(577+(576+(575+(574+(573+(572+(571+(5 70+(569+(568+(567+(566+(565+(564+(563+(562+(561+(560+(559+(558+(557+(556+(555+(554+(553+(552+(551+(550+(5 49+(548+(547+(546+(545+(544+(543+(542+(541+(540+(539+(538+(537+(536+(535+(534+(533+(532+(531+(530+(529+(5 28+(527+(526+(525+(524+(523+(522+(521+(520+(519+(518+(517+(516+(515+(514+(513+(512+(511+(510+(509+(508+(5 07+(506+(505+(504+(503+(502+(501+(500+(499+(498+(497+(496+(495+(494+(493+(492+(491+(490+(489+(488+(487+(4 86+(485+(484+(483+(482+(481+(480+(479+(478+(477+(476+(475+(474+(473+(472+(471+(470+(469+(468+(467+(466+(4 65+(464+(463+(462+(461+(460+(459+(458+(457+(456+(455+(454+(453+(452+(451+(450+(449+(448+(447+(446+(445+(4 44+(443+(442+(441+(440+(439+(438+(437+(436+(435+(434+(433+(432+(431+(430+(429+(428+(427+(426+(425+(424+(4 23+(422+(421+(420+(419+(418+(417+(416+(415+(414+(413+(412+(411+(410+(409+(408+(407+(406+(405+(404+(403+(4 02+(401+(400+(399+(398+(397+(396+(395+(394+(393+(392+(391+(390+(389+(388+(387+(386+(385+(384+(383+(382+(3 81+(380+(379+(378+(377+(376+(375+(374+(373+(372+(371+(370+(369+(368+(367+(366+(365+(364+(363+(362+(361+(3 60+(359+(358+(357+(356+(355+(354+(353+(352+(351+(350+(349+(348+(347+(346+(345+(344+(343+(342+(341+(340+(3 39+(338+(337+(336+(335+(334+(333+(332+(331+(330+(329+(328+(327+(326+(325+(324+(323+(322+(321+(320+(319+(3 18+(317+(316+(315+(314+(313+(312+(311+(310+(309+(308+(307+(306+(305+(304+(303+(302+(301+(300+(299+(298+(2 97+(296+(295+(294+(293+(292+(291+(290+(289+(288+(287+(286+(285+(284+(283+(282+(281+(280+(279+(278+(277+(2 76+(275+(274+(273+(272+(271+(270+(269+(268+(267+(266+(265+(264+(263+(262+(261+(260+(259+(258+(257+(256+(2 55+(254+(253+(252+(251+(250+(249+(248+(247+(246+(245+(244+(243+(242+(241+(240+(239+(238+(237+(236+(235+(2 34+(233+(232+(231+(230+(229+(228+(227+(226+(225+(224+(223+(222+(221+(220+(219+(218+(217+(216+(testcase ./test.exp completed in 8 seconds

		=== clic Summary ===

# of expected passes		67
runtest completed at Tue Apr 21 16:35:55 2015
